{  
   "modelTopology":{  
      "backend":"tensorflow",
      "model_config":{  
         "config":[  
            {  
               "config":{  
                  "kernel_constraint":null,
                  "data_format":"channels_last",
                  "bias_regularizer":null,
                  "strides":[  
                     1,
                     1
                  ],
                  "bias_initializer":{  
                     "config":{  

                     },
                     "class_name":"Zeros"
                  },
                  "activity_regularizer":null,
                  "kernel_size":[  
                     2,
                     8
                  ],
                  "trainable":true,
                  "kernel_initializer":{  
                     "config":{  
                        "mode":"fan_avg",
                        "seed":null,
                        "distribution":"uniform",
                        "scale":1.0
                     },
                     "class_name":"VarianceScaling"
                  },
                  "name":"conv2d_1",
                  "dilation_rate":[  
                     1,
                     1
                  ],
                  "batch_input_shape":[  
                     null,
                     43,
                     232,
                     1
                  ],
                  "kernel_regularizer":null,
                  "filters":8,
                  "bias_constraint":null,
                  "activation":"relu",
                  "use_bias":true,
                  "padding":"valid",
                  "dtype":"float32"
               },
               "class_name":"Conv2D"
            },
            {  
               "config":{  
                  "data_format":"channels_last",
                  "pool_size":[  
                     2,
                     2
                  ],
                  "strides":[  
                     2,
                     2
                  ],
                  "trainable":true,
                  "padding":"valid",
                  "name":"max_pooling2d_1"
               },
               "class_name":"MaxPooling2D"
            },
            {  
               "config":{  
                  "kernel_constraint":null,
                  "data_format":"channels_last",
                  "kernel_initializer":{  
                     "config":{  
                        "mode":"fan_avg",
                        "seed":null,
                        "distribution":"uniform",
                        "scale":1.0
                     },
                     "class_name":"VarianceScaling"
                  },
                  "kernel_regularizer":null,
                  "bias_initializer":{  
                     "config":{  

                     },
                     "class_name":"Zeros"
                  },
                  "activity_regularizer":null,
                  "kernel_size":[  
                     2,
                     4
                  ],
                  "trainable":true,
                  "name":"conv2d_2",
                  "dilation_rate":[  
                     1,
                     1
                  ],
                  "bias_regularizer":null,
                  "filters":32,
                  "bias_constraint":null,
                  "activation":"relu",
                  "use_bias":true,
                  "padding":"valid",
                  "strides":[  
                     1,
                     1
                  ]
               },
               "class_name":"Conv2D"
            },
            {  
               "config":{  
                  "data_format":"channels_last",
                  "pool_size":[  
                     2,
                     2
                  ],
                  "strides":[  
                     2,
                     2
                  ],
                  "trainable":true,
                  "padding":"valid",
                  "name":"max_pooling2d_2"
               },
               "class_name":"MaxPooling2D"
            },
            {  
               "config":{  
                  "kernel_constraint":null,
                  "data_format":"channels_last",
                  "kernel_initializer":{  
                     "config":{  
                        "mode":"fan_avg",
                        "seed":null,
                        "distribution":"uniform",
                        "scale":1.0
                     },
                     "class_name":"VarianceScaling"
                  },
                  "kernel_regularizer":null,
                  "bias_initializer":{  
                     "config":{  

                     },
                     "class_name":"Zeros"
                  },
                  "activity_regularizer":null,
                  "kernel_size":[  
                     2,
                     4
                  ],
                  "trainable":true,
                  "name":"conv2d_3",
                  "dilation_rate":[  
                     1,
                     1
                  ],
                  "bias_regularizer":null,
                  "filters":32,
                  "bias_constraint":null,
                  "activation":"relu",
                  "use_bias":true,
                  "padding":"valid",
                  "strides":[  
                     1,
                     1
                  ]
               },
               "class_name":"Conv2D"
            },
            {  
               "config":{  
                  "data_format":"channels_last",
                  "pool_size":[  
                     2,
                     2
                  ],
                  "strides":[  
                     2,
                     2
                  ],
                  "trainable":true,
                  "padding":"valid",
                  "name":"max_pooling2d_3"
               },
               "class_name":"MaxPooling2D"
            },
            {  
               "config":{  
                  "kernel_constraint":null,
                  "data_format":"channels_last",
                  "kernel_initializer":{  
                     "config":{  
                        "mode":"fan_avg",
                        "seed":null,
                        "distribution":"uniform",
                        "scale":1.0
                     },
                     "class_name":"VarianceScaling"
                  },
                  "kernel_regularizer":null,
                  "bias_initializer":{  
                     "config":{  

                     },
                     "class_name":"Zeros"
                  },
                  "activity_regularizer":null,
                  "kernel_size":[  
                     2,
                     4
                  ],
                  "trainable":true,
                  "name":"conv2d_4",
                  "dilation_rate":[  
                     1,
                     1
                  ],
                  "bias_regularizer":null,
                  "filters":32,
                  "bias_constraint":null,
                  "activation":"relu",
                  "use_bias":true,
                  "padding":"valid",
                  "strides":[  
                     1,
                     1
                  ]
               },
               "class_name":"Conv2D"
            },
            {  
               "config":{  
                  "data_format":"channels_last",
                  "pool_size":[  
                     2,
                     2
                  ],
                  "strides":[  
                     1,
                     2
                  ],
                  "trainable":true,
                  "padding":"valid",
                  "name":"max_pooling2d_4"
               },
               "class_name":"MaxPooling2D"
            },
            {  
               "config":{  
                  "data_format":"channels_last",
                  "trainable":true,
                  "name":"flatten_1"
               },
               "class_name":"Flatten"
            },
            {  
               "config":{  
                  "noise_shape":null,
                  "rate":0.25,
                  "trainable":true,
                  "seed":null,
                  "name":"dropout_1"
               },
               "class_name":"Dropout"
            },
            {  
               "config":{  
                  "units":2000,
                  "kernel_constraint":null,
                  "kernel_initializer":{  
                     "config":{  
                        "mode":"fan_avg",
                        "seed":null,
                        "distribution":"uniform",
                        "scale":1.0
                     },
                     "class_name":"VarianceScaling"
                  },
                  "kernel_regularizer":null,
                  "bias_initializer":{  
                     "config":{  

                     },
                     "class_name":"Zeros"
                  },
                  "activity_regularizer":null,
                  "trainable":true,
                  "name":"dense_1",
                  "bias_regularizer":null,
                  "activation":"relu",
                  "use_bias":true,
                  "bias_constraint":null
               },
               "class_name":"Dense"
            },
            {  
               "config":{  
                  "noise_shape":null,
                  "rate":0.5,
                  "trainable":true,
                  "seed":null,
                  "name":"dropout_2"
               },
               "class_name":"Dropout"
            },
            {  
               "config":{  
                  "units":6,
                  "kernel_constraint":null,
                  "kernel_initializer":{  
                     "config":{  
                        "mode":"fan_avg",
                        "seed":null,
                        "distribution":"uniform",
                        "scale":1.0
                     },
                     "class_name":"VarianceScaling"
                  },
                  "kernel_regularizer":null,
                  "bias_initializer":{  
                     "config":{  

                     },
                     "class_name":"Zeros"
                  },
                  "activity_regularizer":null,
                  "trainable":true,
                  "name":"dense_2",
                  "bias_regularizer":null,
                  "activation":"softmax",
                  "use_bias":true,
                  "bias_constraint":null
               },
               "class_name":"Dense"
            }
         ],
         "class_name":"Sequential"
      },
      "keras_version":"2.2.2"
   },
   "weightsManifest":[  
      {  
         "weights":[  
            {  
               "shape":[  
                  2,
                  8,
                  1,
                  8
               ],
               "dtype":"float32",
               "name":"conv2d_1/kernel"
            },
            {  
               "shape":[  
                  8
               ],
               "dtype":"float32",
               "name":"conv2d_1/bias"
            },
            {  
               "shape":[  
                  2,
                  4,
                  8,
                  32
               ],
               "dtype":"float32",
               "name":"conv2d_2/kernel"
            },
            {  
               "shape":[  
                  32
               ],
               "dtype":"float32",
               "name":"conv2d_2/bias"
            },
            {  
               "shape":[  
                  2,
                  4,
                  32,
                  32
               ],
               "dtype":"float32",
               "name":"conv2d_3/kernel"
            },
            {  
               "shape":[  
                  32
               ],
               "dtype":"float32",
               "name":"conv2d_3/bias"
            },
            {  
               "shape":[  
                  2,
                  4,
                  32,
                  32
               ],
               "dtype":"float32",
               "name":"conv2d_4/kernel"
            },
            {  
               "shape":[  
                  32
               ],
               "dtype":"float32",
               "name":"conv2d_4/bias"
            },
            {  
               "shape":[  
                  704,
                  2000
               ],
               "dtype":"float32",
               "name":"dense_1/kernel"
            },
            {  
               "shape":[  
                  2000
               ],
               "dtype":"float32",
               "name":"dense_1/bias"
            },
            {  
               "shape":[  
                  2000,
                  6
               ],
               "dtype":"float32",
               "name":"dense_2/kernel"
            },
            {  
               "shape":[  
                  6
               ],
               "dtype":"float32",
               "name":"dense_2/bias"
            }
         ],
         "paths":[  
            "group1-shard1of2",
            "group1-shard2of2"
         ]
      }
   ]
}
